bench/results/redis/fsB_mt_r1-1_d100_P1.out
Json file fsB_mt_r1-1_d100_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     2983564 ops,  145906 (avg:  149176) ops/sec, 19.73MB/sec (avg: 18.49MB/sec),  0.05 (avg:  0.05) msec latency

warning: GET miss rate 25.90% above target 1.00% (386376 misses / 1491780 ops)

CPU Utilization Summary
  Total CPU time:   31.780s  (user 12.073s, sys 19.707s)
  Wall time:        20.001s
  Cores used:       1.589   (avg 79.4% across 2 worker threads)
  Peak utilization: 160.7%
Saving JSON output file: fsB_mt_r1-1_d100_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        74588.43          ---          ---         0.05397         0.05500         0.08700         0.10300     10618.53 
Gets        74588.23     55269.63     19318.60         0.05282         0.05500         0.08700         0.10300      8311.07 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     149176.66     55269.63     19318.60         0.05340         0.05500         0.08700         0.10300     18929.60