bench/results/redis/fsB_mt_r1-1_d100_P16.out
Json file fsB_mt_r1-1_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     9052576 ops,  444714 (avg:  452621) ops/sec, 60.77MB/sec (avg: 61.64MB/sec),  0.28 (avg:  0.28) msec latency


CPU Utilization Summary
  Total CPU time:   13.732s  (user 9.128s, sys 4.603s)
  Wall time:        20.001s
  Cores used:       0.687   (avg 34.3% across 2 worker threads)
  Peak utilization: 71.8%
Saving JSON output file: fsB_mt_r1-1_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       226310.48          ---          ---         0.27859         0.27900         0.39900         0.43100     32217.91 
Gets       226310.48    224216.72      2093.76         0.27859         0.27900         0.39900         0.43100     30902.24 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     452620.97    224216.72      2093.76         0.27859         0.27900         0.39900         0.43100     63120.15