bench/results/redis/fsB_mt_r1-1_d1024_P16.out
Json file fsB_mt_r1-1_d1024_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     4790394 ops,  236076 (avg:  239516) ops/sec, 240.23MB/sec (avg: 241.59MB/sec),  0.54 (avg:  0.53) msec latency


CPU Utilization Summary
  Total CPU time:   16.345s  (user 7.421s, sys 8.924s)
  Wall time:        20.001s
  Cores used:       0.817   (avg 40.9% across 2 worker threads)
  Peak utilization: 87.2%
Saving JSON output file: fsB_mt_r1-1_d1024_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       119756.31          ---          ---         0.53257         0.51100         0.67100         0.74300    125226.96 
Gets       119755.96    119755.96         0.00         0.53266         0.51100         0.67100         0.74300    122157.76 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     239512.27    119755.96         0.00         0.53261         0.51100         0.67100         0.74300    247384.72