bench/results/redis/fsB_mt_r1-9_d100_P16.out
Json file fsB_mt_r1-9_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     7433238 ops,  415043 (avg:  371657) ops/sec, 115.06MB/sec (avg: 156.24MB/sec),  0.30 (avg:  0.34) msec latency


CPU Utilization Summary
  Total CPU time:   20.587s  (user 9.886s, sys 10.701s)
  Wall time:        20.001s
  Cores used:       1.029   (avg 51.5% across 2 worker threads)
  Peak utilization: 110.9%
Saving JSON output file: fsB_mt_r1-9_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        37165.79          ---          ---         0.34146         0.35100         0.43900         0.51900      5290.95 
Gets       334490.39    334490.39         0.00         0.34197         0.35100         0.43900         0.51900    154695.84 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     371656.18    334490.39         0.00         0.34192         0.35100         0.43900         0.51900    159986.80