bench/results/redis/fsB_mt_r1-9_d1024_P1.out
Json file fsB_mt_r1-9_d1024_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     3061383 ops,  146022 (avg:  153067) ops/sec, 110.81MB/sec (avg: 90.37MB/sec),  0.05 (avg:  0.05) msec latency


CPU Utilization Summary
  Total CPU time:   33.479s  (user 13.613s, sys 19.866s)
  Wall time:        20.001s
  Cores used:       1.674   (avg 83.7% across 2 worker threads)
  Peak utilization: 172.2%
Saving JSON output file: fsB_mt_r1-9_d1024_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        15306.92          ---          ---         0.05352         0.05500         0.07900         0.11100     16006.15 
Gets       137760.40    137760.40         0.00         0.05188         0.05500         0.07900         0.10300     76529.61 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     153067.32    137760.40         0.00         0.05205         0.05500         0.07900         0.10300     92535.76