bench/results/redis/fsB_mt_r1-9_d1024_P16.out
Json file fsB_mt_r1-9_d1024_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     5836167 ops,  270444 (avg:  291803) ops/sec, 252.84MB/sec (avg: 240.60MB/sec),  0.47 (avg:  0.44) msec latency


CPU Utilization Summary
  Total CPU time:   23.293s  (user 9.802s, sys 13.491s)
  Wall time:        20.001s
  Cores used:       1.165   (avg 58.2% across 2 worker threads)
  Peak utilization: 125.6%
Saving JSON output file: fsB_mt_r1-9_d1024_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        29180.06          ---          ---         0.43570         0.43900         0.55100         0.66300     30513.02 
Gets       262618.58    262618.58         0.00         0.43715         0.43900         0.55900         0.67900    215859.78 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     291798.64    262618.58         0.00         0.43700         0.43900         0.55900         0.67900    246372.80